nxp-mcuxpresso/mcux-sdk/boards/twrkm34z50mv3/project_template/pin_mux.c
/*
 * Copyright 2021 NXP.
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v9.0
processor: MKM34Z128Axxx5
package_id: MKM34Z128ACLL5
mcu_data: ksdk2_0
processor_version: 0.9.1
board: TWR-KM34Z50MV3
pin_labels:
- {pin_num: '1', pin_signal: LCD23/PTA0, label: GND, identifier: LCD_23;LCD_P23}
- {pin_num: '2', pin_signal: LCD24/PTA1, label: GND, identifier: LCD_24;LCD_P24}
- {pin_num: '3', pin_signal: LCD25/PTA2, label: 'DS1[15]/LCD_P45', identifier: LCD_P45}
- {pin_num: '4', pin_signal: LCD26/PTA3, label: 'DS1[17]/LCD_P26', identifier: LCD_P26}
- {pin_num: '5', pin_signal: LCD27/PTA4/LLWU_P15/NMI_B, label: SW1, identifier: SW1;LCD_P27}
- {pin_num: '6', pin_signal: LCD28/PTA5/CMP0OUT, label: 'DS1[18]/LCD_P28', identifier: LCD_P28}
- {pin_num: '7', pin_signal: LCD29/PTA6/PXBAR_IN0/LLWU_P14, label: 'DS1[6]/LCD_P29', identifier: LCD_P29}
- {pin_num: '8', pin_signal: LCD30/PTA7/PXBAR_OUT0, label: 'DS1[14]/LCD_P30', identifier: LCD_P30}
- {pin_num: '9', pin_signal: LCD31/PTB0, label: 'DS1[5]/LCD_P31', identifier: LCD_P31}
- {pin_num: '12', pin_signal: LCD32/PTB1, label: 'DS1[4]/LCD_P32', identifier: LCD_P32}
- {pin_num: '13', pin_signal: LCD33/PTB2, label: 'DS1[12]/LCD_P33', identifier: LCD_P33}
- {pin_num: '14', pin_signal: LCD34/PTB3, label: 'J23[4]/I2C1_SDA', identifier: LCD_34;LCD_P34}
- {pin_num: '15', pin_signal: LCD35/PTB4, label: 'J23[3]/I2C1_SCL', identifier: LCD_35;LCD_P35}
- {pin_num: '16', pin_signal: LCD36/PTB5, label: 'DS1[2]/LCD_P36', identifier: LCD_P36}
- {pin_num: '17', pin_signal: LCD37/CMP1P0/PTB6, label: 'DS1[13]/LCD_P50', identifier: LCD_P50}
- {pin_num: '18', pin_signal: LCD38/PTB7/AFE_CLK, label: MCU_PWR}
- {pin_num: '19', pin_signal: LCD39/PTC0/SCI3_RTS/PXBAR_IN1, label: GND}
- {pin_num: '20', pin_signal: LCD40/CMP1P1/PTC1/SCI3_CTS, label: 'J23[19]/UART3_CTS'}
- {pin_num: '21', pin_signal: LCD41/PTC2/SCI3_TxD/PXBAR_OUT1, label: 'J23[18]/UART3_TX'}
- {pin_num: '22', pin_signal: LCD42/CMP0P3/PTC3/SCI3_RxD/LLWU_P13, label: 'J23[17]/UART3_RX'}
- {pin_num: '23', pin_signal: LCD43/PTC4, label: 'DS1[9]/LCD_P43', identifier: LCD_P43}
- {pin_num: '44', pin_signal: AD0/PTC5/SCI0_RTS/LLWU_P12, label: 'J31[18]/ADC0_SE0'}
- {pin_num: '45', pin_signal: AD1/PTC6/SCI0_CTS/QT1, label: 'J31[20]/ADC0_SE1'}
- {pin_num: '46', pin_signal: AD2/PTC7/SCI0_TxD/PXBAR_OUT2, label: 'J31[22]/ADC0_SE2'}
- {pin_num: '47', pin_signal: CMP0P0/PTD0/SCI0_RxD/PXBAR_IN2/LLWU_P11, label: 'J31[6]/AFE_SDADP1', identifier: SW1}
- {pin_num: '49', pin_signal: CMP0P1/PTD2/SCI1_RxD/SPI0_SCK/PXBAR_IN3/LLWU_P10, label: 'J32[A63]'}
- {pin_num: '48', pin_signal: PTD1/SCI1_TxD/SPI0_SS_B/PXBAR_OUT3/QT3, label: 'J31[8]/AFE_SDADM1', identifier: LED_ORANGE}
- {pin_num: '50', pin_signal: PTD3/SCI1_CTS/SPI0_MOSI, label: 'J23[16]'}
- {pin_num: '51', pin_signal: AD3/PTD4/SCI1_RTS/SPI0_MISO/LLWU_P9, label: 'J31[10]/AFE_SDADP2'}
- {pin_num: '52', pin_signal: AD4/PTD5/LPTIM2/QT0/SCI3_CTS, label: 'J31[12]/AFE_SDADM2'}
- {pin_num: '53', pin_signal: AD5/PTD6/LPTIM1/CMP1OUT/SCI3_RTS/LLWU_P8, label: 'J22[18]/TWRPI-ID1'}
- {pin_num: '54', pin_signal: CMP0P4/PTD7/I2C0_SCL/PXBAR_IN4/SCI3_RxD/LLWU_P7, label: 'J31[14]/AFE_SDADP3'}
- {pin_num: '55', pin_signal: PTE0/I2C0_SDA/PXBAR_OUT4/SCI3_TxD/CLKOUT, label: 'J31[16]/AFE_SDADM3'}
- {pin_num: '56', pin_signal: PTE1/RESET_B, label: GND}
- {pin_num: '57', pin_signal: EXTAL1/PTE2/EWM_IN/PXBAR_IN6/I2C1_SDA, label: GND}
- {pin_num: '58', pin_signal: XTAL1/PTE3/EWM_OUT/AFE_CLK/I2C1_SCL, label: 'J7[2]/Y2[1]/XTAL_8MHz', identifier: XTAL0}
- {pin_num: '64', pin_signal: PTE5/QT3/SCI2_RTS/EWM_OUT/LLWU_P6, label: 'J32[B35]', identifier: LED_GREEN}
- {pin_num: '63', pin_signal: PTE4/LPTIM0/SCI2_CTS/EWM_IN, label: D4/RED, identifier: LED_RED;SW2}
- {pin_num: '65', pin_signal: CMP0P2/PTE6/PXBAR_IN5/SCI2_RxD/LLWU_P5/I2C0_SCL/SWD_IO, label: 'J24[2]/SWD_DIO_TGTMCU'}
- {pin_num: '66', pin_signal: AD6/PTE7/PXBAR_OUT5/SCI2_TxD/I2C0_SDA/SWD_CLK, label: 'J24[4]/SWD_CLK_TGTMCU'}
- {pin_num: '67', pin_signal: AD7/PTF0/RTCCLKOUT/QT2/CMP0OUT/LLWU_P4, label: NC}
- {pin_num: '68', pin_signal: LCD0/AD8/PTF1/QT0/PXBAR_OUT6, label: 'J23[15]', identifier: LED_RED}
- {pin_num: '69', pin_signal: LCD1/AD9/PTF2/CMP1OUT/RTCCLKOUT, label: 'J20[1]/TEMP_SENSE', identifier: ADC_TEMP}
- {pin_num: '70', pin_signal: LCD2/PTF3/SPI1_SS_B/LPTIM1/SCI0_RxD, label: 'J22[12]/TWRPI-ADC2', identifier: FLASH_CS}
- {pin_num: '71', pin_signal: LCD3/PTF4/SPI1_SCK/LPTIM0/SCI0_TxD, label: GND, identifier: FLASH_CLK}
- {pin_num: '72', pin_signal: LCD4/PTF5/SPI1_MISO/I2C1_SCL, label: GND, identifier: FLASH_SO}
- {pin_num: '73', pin_signal: LCD5/PTF6/SPI1_MOSI/I2C1_SDA/LLWU_P3, label: GND, identifier: FLASH_SI}
- {pin_num: '74', pin_signal: LCD6/PTF7/QT2/CLKOUT, label: GND}
- {pin_num: '75', pin_signal: LCD7/PTG0/QT1/LPTIM2, label: 'J25[20]/QTMR0_TMR1'}
- {pin_num: '76', pin_signal: LCD8/AD10/PTG1/LLWU_P2/LPTIM0, label: NC}
- {pin_num: '77', pin_signal: LCD9/AD11/PTG2/SPI0_SS_B/LLWU_P1, label: 'J32[B9]/J9[2]/U4[1]/SPI0_PCS0', identifier: FLASH_CS;LCD_P9}
- {pin_num: '78', pin_signal: LCD10/PTG3/SPI0_SCK/I2C0_SCL, label: 'J32[B7]/J12[1]/U4[6]/SPI0_SCK', identifier: FLASH_CLK;LCD_P10}
- {pin_num: '79', pin_signal: LCD11/PTG4/SPI0_MOSI/I2C0_SDA, label: 'J32[B10]/J15[1]/U4[5]/SPI0_MOSI', identifier: FLASH_SI;LCD_P11}
- {pin_num: '80', pin_signal: LCD12/PTG5/SPI0_MISO/LPTIM1, label: 'J32[B11]/J13[2]/U4[2]/SPI0_MISO', identifier: FLASH_SO;LCD_P12}
- {pin_num: '81', pin_signal: LCD13/PTG6/LLWU_P0/LPTIM2, label: 'J25[22]/UART0_TX', identifier: LCD_13;LCD_P13}
- {pin_num: '82', pin_signal: LCD14/PTG7, label: 'J25[24]/UART0_RX', identifier: LCD_P14}
- {pin_num: '83', pin_signal: LCD15/PTH0, label: 'J32[B55]/J32[B56]', identifier: LCD_P15}
- {pin_num: '84', pin_signal: LCD16/PTH1, label: 'J32[B57]/J32[B58]', identifier: LCD_P16}
- {pin_num: '85', pin_signal: LCD17/PTH2, label: 'J32[B59]/J32[B60]', identifier: LCD_P17}
- {pin_num: '86', pin_signal: LCD18/PTH3, label: GND, identifier: LCD_P18}
- {pin_num: '87', pin_signal: LCD19/PTH4, label: 'DS1[22]/LCD_P19', identifier: LCD_P19}
- {pin_num: '88', pin_signal: LCD20/PTH5, label: 'DS1[27]/LCD_P20', identifier: LCD_P20}
- {pin_num: '93', pin_signal: LCD21/PTI2, label: 'J32[B23]', identifier: LCD_P21}
- {pin_num: '94', pin_signal: LCD22/PTI3, label: 'DS1[26]/LCD_P22', identifier: LCD_P22}
- {pin_num: '89', pin_signal: PTH6/SCI1_CTS/SPI1_SS_B/PXBAR_IN7, label: MCU_PWR}
- {pin_num: '90', pin_signal: PTH7/SCI1_RTS/SPI1_SCK/PXBAR_OUT7, label: 'J32[B21]'}
- {pin_num: '91', pin_signal: CMP0P5/PTI0/SCI1_RxD/PXBAR_IN8/SPI1_MISO/SPI1_MOSI, label: 'J32[A43]'}
- {pin_num: '92', pin_signal: PTI1/SCI1_TxD/PXBAR_OUT8/SPI1_MOSI/SPI1_MISO, label: 'J32[A44]'}
- {pin_num: '96', pin_signal: VLL3, label: 'J33[2]/VLL3'}
- {pin_num: '97', pin_signal: VLL2, label: VLL2}
- {pin_num: '98', pin_signal: VLL1, label: VLL1}
- {pin_num: '99', pin_signal: VCAP2, label: C83/VCAP2}
- {pin_num: '100', pin_signal: VCAP1, label: C83/VCAP1}
- {pin_num: '62', pin_signal: VDD62, label: D3/GRN, identifier: LED_GREEN}
- {pin_num: '24', pin_signal: VBAT, label: 'J1[2]/VBAT'}
- {pin_num: '30', pin_signal: WKUP/TAMPER0, label: 'J25[2]'}
- {pin_num: '29', pin_signal: TAMPER1, label: 'J25[4]'}
- {pin_num: '28', pin_signal: TAMPER2, label: 'J25[6]'}
- {pin_num: '31', pin_signal: VDDA, label: VDDA}
- {pin_num: '32', pin_signal: VSSA, label: VSSA}
- {pin_num: '37', pin_signal: VREFH, label: GND}
- {pin_num: '38', pin_signal: VREFL, label: GND}
- {pin_num: '41', pin_signal: VREF, label: 'J2[2]/VREF'}
- {pin_num: '33', pin_signal: SDADP0, label: 'Y1[1]/XTAL_32K', identifier: XTAL_32K}
- {pin_num: '34', pin_signal: SDADM0, label: 'Y1[2]/EXTAL_32K', identifier: EXTAL_32K}
- {pin_num: '35', pin_signal: SDADP1, label: GND}
- {pin_num: '36', pin_signal: SDADM1, label: GND}
- {pin_num: '39', pin_signal: SDADP2/CMP1P2, label: GND}
- {pin_num: '43', pin_signal: SDADM3/CMP1P5, label: VDDA_AFE}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_port.h"
#include "fsl_gpio.h"
#include "fsl_xbar.h"
#include "pin_mux.h"

