nxp-mcuxpresso/mcux-sdk/boards/twrkm34z50mv3/project_template/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitOSCPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitOSCPins(void)
{
    /* PCTLE Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortE);

    /* PORTE2 (pin 57) is configured as EXTAL1 */
    PORT_SetPinMux(PORTE, 2U, kPORT_PinDisabledOrAnalog);

    /* PORTE3 (pin 58) is configured as XTAL1 */
    PORT_SetPinMux(BOARD_XTAL0_PORT, BOARD_XTAL0_PIN, kPORT_PinDisabledOrAnalog);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitSPI_FLASHPins:
- options: {prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '73', peripheral: SPI1, signal: MOSI, pin_signal: LCD5/PTF6/SPI1_MOSI/I2C1_SDA/LLWU_P3, direction: OUTPUT, slew_rate: fast, pull_select: down, pull_enable: disable}
  - {pin_num: '72', peripheral: SPI1, signal: MISO, pin_signal: LCD4/PTF5/SPI1_MISO/I2C1_SCL, direction: INPUT, slew_rate: fast, pull_select: down, pull_enable: disable}
  - {pin_num: '71', peripheral: SPI1, signal: SCK, pin_signal: LCD3/PTF4/SPI1_SCK/LPTIM0/SCI0_TxD, direction: OUTPUT, slew_rate: fast, pull_select: down, pull_enable: disable}
  - {pin_num: '70', peripheral: SPI1, signal: PCS0, pin_signal: LCD2/PTF3/SPI1_SS_B/LPTIM1/SCI0_RxD, direction: OUTPUT, slew_rate: fast, pull_select: down, pull_enable: disable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitSPI_FLASHPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitSPI_FLASHPins(void)
{
    /* PCTLF Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortF);

    const port_pin_config_t FLASH_CS = {/* Internal pull-up/down resistor is disabled */
                                        kPORT_PullDisable,
                                        /* Fast slew rate is configured */
                                        kPORT_FastSlewRate,
                                        /* Pin is configured as SPI1_SS_B */
                                        kPORT_MuxAlt2,
                                        /* Pin Control Register fields [15:0] are not locked */
                                        kPORT_UnlockRegister};
    /* PORTF3 (pin 70) is configured as SPI1_SS_B */
    PORT_SetPinConfig(BOARD_FLASH_CS_PORT, BOARD_FLASH_CS_PIN, &FLASH_CS);

    const port_pin_config_t FLASH_CLK = {/* Internal pull-up/down resistor is disabled */
                                         kPORT_PullDisable,
                                         /* Fast slew rate is configured */
                                         kPORT_FastSlewRate,
                                         /* Pin is configured as SPI1_SCK */
                                         kPORT_MuxAlt2,
                                         /* Pin Control Register fields [15:0] are not locked */
                                         kPORT_UnlockRegister};
    /* PORTF4 (pin 71) is configured as SPI1_SCK */
    PORT_SetPinConfig(BOARD_FLASH_CLK_PORT, BOARD_FLASH_CLK_PIN, &FLASH_CLK);

    const port_pin_config_t FLASH_SO = {/* Internal pull-up/down resistor is disabled */
                                        kPORT_PullDisable,
                                        /* Fast slew rate is configured */
                                        kPORT_FastSlewRate,
                                        /* Pin is configured as SPI1_MISO */
                                        kPORT_MuxAlt2,
                                        /* Pin Control Register fields [15:0] are not locked */
                                        kPORT_UnlockRegister};
    /* PORTF5 (pin 72) is configured as SPI1_MISO */
    PORT_SetPinConfig(BOARD_FLASH_SO_PORT, BOARD_FLASH_SO_PIN, &FLASH_SO);

    const port_pin_config_t FLASH_SI = {/* Internal pull-up/down resistor is disabled */
                                        kPORT_PullDisable,
                                        /* Fast slew rate is configured */
                                        kPORT_FastSlewRate,
                                        /* Pin is configured as SPI1_MOSI */
                                        kPORT_MuxAlt2,
                                        /* Pin Control Register fields [15:0] are not locked */
                                        kPORT_UnlockRegister};
    /* PORTF6 (pin 73) is configured as SPI1_MOSI */
    PORT_SetPinConfig(BOARD_FLASH_SI_PORT, BOARD_FLASH_SI_PIN, &FLASH_SI);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitInfra_RedPins:
- options: {prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '90', peripheral: SIM, signal: UART_MOD_AND_OUT, pin_signal: PTH7/SCI1_RTS/SPI1_SCK/PXBAR_OUT7, slew_rate: fast, pull_select: down, pull_enable: disable}
  - {peripheral: SIM, signal: UART_MOD_CARR, pin_signal: RTC_CLK_Output}
  - {peripheral: SIM, signal: UART_MOD_DATA, pin_signal: UART0_TX_output}
  - {pin_num: '47', peripheral: CMP0, signal: 'IN, 0', pin_signal: CMP0P0/PTD0/SCI0_RxD/PXBAR_IN2/LLWU_P11, identifier: ''}
  - {peripheral: UART0, signal: RX, pin_signal: CMP0_Output}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitInfra_RedPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitInfra_RedPins(void)
{
    /* PCTLD Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortD);
    /* PCTLH Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortH);
    /* Peripheral Crossbar Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_Xbar);

