nxp-mcuxpresso/mcux-sdk/boards/twrkm34z50mv3/project_template/pin_mux.c
    const port_pin_config_t LCD_P35 = {/* Internal pull-up/down resistor is disabled */
                                       kPORT_PullDisable,
                                       /* Fast slew rate is configured */
                                       kPORT_FastSlewRate,
                                       /* Pin is configured as LCD35 */
                                       kPORT_PinDisabledOrAnalog,
                                       /* Pin Control Register fields [15:0] are not locked */
                                       kPORT_UnlockRegister};
    /* PORTB4 (pin 15) is configured as LCD35 */
    PORT_SetPinConfig(BOARD_LCD_P35_PORT, BOARD_LCD_P35_PIN, &LCD_P35);

    /* PORTB5 (pin 16) is configured as LCD36 */
    PORT_SetPinMux(BOARD_LCD_P36_PORT, BOARD_LCD_P36_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTB6 (pin 17) is configured as LCD37 */
    PORT_SetPinMux(BOARD_LCD_P50_PORT, BOARD_LCD_P50_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTC4 (pin 23) is configured as LCD43 */
    PORT_SetPinMux(BOARD_LCD_P43_PORT, BOARD_LCD_P43_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTG2 (pin 77) is configured as LCD9 */
    PORT_SetPinMux(BOARD_LCD_P9_PORT, BOARD_LCD_P9_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTG3 (pin 78) is configured as LCD10 */
    PORT_SetPinMux(BOARD_LCD_P10_PORT, BOARD_LCD_P10_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTG4 (pin 79) is configured as LCD11 */
    PORT_SetPinMux(BOARD_LCD_P11_PORT, BOARD_LCD_P11_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTG5 (pin 80) is configured as LCD12 */
    PORT_SetPinMux(BOARD_LCD_P12_PORT, BOARD_LCD_P12_PIN, kPORT_PinDisabledOrAnalog);

    const port_pin_config_t LCD_P13 = {/* Internal pull-up/down resistor is disabled */
                                       kPORT_PullDisable,
                                       /* Fast slew rate is configured */
                                       kPORT_FastSlewRate,
                                       /* Pin is configured as LCD13 */
                                       kPORT_PinDisabledOrAnalog,
                                       /* Pin Control Register fields [15:0] are not locked */
                                       kPORT_UnlockRegister};
    /* PORTG6 (pin 81) is configured as LCD13 */
    PORT_SetPinConfig(BOARD_LCD_P13_PORT, BOARD_LCD_P13_PIN, &LCD_P13);

    const port_pin_config_t LCD_P14 = {/* Internal pull-up/down resistor is disabled */
                                       kPORT_PullDisable,
                                       /* Fast slew rate is configured */
                                       kPORT_FastSlewRate,
                                       /* Pin is configured as LCD14 */
                                       kPORT_PinDisabledOrAnalog,
                                       /* Pin Control Register fields [15:0] are not locked */
                                       kPORT_UnlockRegister};
    /* PORTG7 (pin 82) is configured as LCD14 */
    PORT_SetPinConfig(BOARD_LCD_P14_PORT, BOARD_LCD_P14_PIN, &LCD_P14);

    /* PORTH0 (pin 83) is configured as LCD15 */
    PORT_SetPinMux(BOARD_LCD_P15_PORT, BOARD_LCD_P15_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTH1 (pin 84) is configured as LCD16 */
    PORT_SetPinMux(BOARD_LCD_P16_PORT, BOARD_LCD_P16_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTH2 (pin 85) is configured as LCD17 */
    PORT_SetPinMux(BOARD_LCD_P17_PORT, BOARD_LCD_P17_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTH3 (pin 86) is configured as LCD18 */
    PORT_SetPinMux(BOARD_LCD_P18_PORT, BOARD_LCD_P18_PIN, kPORT_PinDisabledOrAnalog);

    const port_pin_config_t LCD_P19 = {/* Internal pull-up/down resistor is disabled */
                                       kPORT_PullDisable,
                                       /* Fast slew rate is configured */
                                       kPORT_FastSlewRate,
                                       /* Pin is configured as LCD19 */
                                       kPORT_PinDisabledOrAnalog,
                                       /* Pin Control Register fields [15:0] are not locked */
                                       kPORT_UnlockRegister};
    /* PORTH4 (pin 87) is configured as LCD19 */
    PORT_SetPinConfig(BOARD_LCD_P19_PORT, BOARD_LCD_P19_PIN, &LCD_P19);

    const port_pin_config_t LCD_P20 = {/* Internal pull-up/down resistor is disabled */
                                       kPORT_PullDisable,
                                       /* Fast slew rate is configured */
                                       kPORT_FastSlewRate,
                                       /* Pin is configured as LCD20 */
                                       kPORT_PinDisabledOrAnalog,
                                       /* Pin Control Register fields [15:0] are not locked */
                                       kPORT_UnlockRegister};
    /* PORTH5 (pin 88) is configured as LCD20 */
    PORT_SetPinConfig(BOARD_LCD_P20_PORT, BOARD_LCD_P20_PIN, &LCD_P20);

    /* PORTI2 (pin 93) is configured as LCD21 */
    PORT_SetPinMux(BOARD_LCD_P21_PORT, BOARD_LCD_P21_PIN, kPORT_PinDisabledOrAnalog);

    const port_pin_config_t LCD_P22 = {/* Internal pull-up/down resistor is disabled */
                                       kPORT_PullDisable,
                                       /* Fast slew rate is configured */
                                       kPORT_FastSlewRate,
                                       /* Pin is configured as LCD22 */
                                       kPORT_PinDisabledOrAnalog,
                                       /* Pin Control Register fields [15:0] are not locked */
                                       kPORT_UnlockRegister};
    /* PORTI3 (pin 94) is configured as LCD22 */
    PORT_SetPinConfig(BOARD_LCD_P22_PORT, BOARD_LCD_P22_PIN, &LCD_P22);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
